Public Attributes | List of all members
API_TextType Struct Reference
Element Manager
Represents a text, or a textual label. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 short  | pen
Pen attribute index.
unsigned short  | faceBits
Style (face) of text:
 short  | font
Font attribute index.
 bool  | fixedAngle
The rotation angle will not change when the element is rotated and this flag is true.
 API_AnchorID  | anchor
Anchor point of the text (see API_AnchorID).
 API_JustID  | just
Justification of the text (see API_JustID).
 double  | size
Character height in mm.
 double  | spacing
Spacing factor between text lines (it should be between -10.0 and -1.0).
 double  | angle
Rotation angle [radian].
 Int32  | charCode
GSCharCode type character code used in the unicode-ANSI string conversion routines of the GSRoot String Manager. Do not use it for string encoding, only for font handling!
Int32  | effectsBits
Special text effects:
 double  | widthFactor
Width scale of the text (it should be between 0.75 and 10.0).
 double  | charSpaceFactor
Spacing scale of the text (it should be between 0.75 and 10.0).
 bool  | fixedSize
Size not depends on output scale if this flag is true.
 bool  | usedContour
Draw the frame of the textblock.
 bool  | usedFill
Draw a solid fill to the background of the textblock.
 short  | contourPen
Pen index of the frame of the textblock.
 short  | fillPen
Pen index of the background of the textblock.
 API_Coord  | loc
Coordinates of text anchor point.
 double  | width
Horizontal size of text box in mm.
 double  | height
Vertical size of text box in mm.
 bool  | nonBreaking
If false then wrap around at the boundary of the destination rectangle.
 bool  | multiStyle
Multistyle text (input only).
 bool  | useEolPos
Use the array of line end positions by creating the element (input only). Only available for multistyle text. (see API_ParagraphType)
 Int32  | nLine
Number of text lines.
 API_Guid  | owner
Belongs to something else e.g. a label.
 double  | contourOffset
The offset value of the frame or opaque background to the bounding box of the text block.
 bool  | flipEnabled
The text should always be readable.
Detailed Description
Represents a text, or a textual label.
Remarks
From Archicad 9 you are able to create multistyle text or textual label. In this case the pen, faceBits, font, just, size, spacing, effectBits members are not used. These members are used only by default element setting and monostyle textual element creating. The paragraphs handle of API_ElementMemo structure contains these informations for each paragraphs of the text. For text related memo data (e.g. content, paragraphs) see the ACAPI_Element_GetMemo function. For more details examine Element Manager example project.
Member Data Documentation
◆ effectsBits
 API_TextType::effectsBits
Special text effects:
 Effect  | Style
 APIEffect_StrikeOut  | Strikethrough text
 APIEffect_SuperScript  | Superscript
 APIEffect_SubScript  | Subscript
 APIEffect_Protected  | Protected text (autotext reference)
◆ faceBits
 API_TextType::faceBits
Style (face) of text:
 Face bit  | Style
 APIFace_Plain  | Plain text
 APIFace_Bold  | Bold
 APIFace_Italic  | Italic
 APIFace_Underline  | Underline